app/views/comments/_comment.html.erb

  <p><%= comment.content %></p>
  <span class="age">Posted at <%= time_ago_in_words(comment.created_at) %> ago.
  (<%= link_to 'Delete', product_comment_path(@product, comment), :confirm => 'Are you sure?', :method => :delete, :remote => true %>)</span>
---
INSERT INTO `comments` (`content`, `user_id`, `product_id`, `created_at`, `updated_at`) VALUES ('tes f dfadf dfdf', NULL, 1, '2011-08-25 07:45:43', '2011-08-25 07:45:43')