app/views/comments/destroy.js.erb

/* Replace the count of comments */
$("#comments_count").html("<%= pluralize(comments.count, 'Comment') %>");
---
SELECT COUNT(*) FROM `comments` WHERE (`comments`.product_id = 1)