app/views/comments/index.html.erb

</div>
<span id="comments_count"><%= pluralize(@comments.count, "Comment") %></span>
---
SELECT COUNT(*) FROM `comments` WHERE (`comments`.product_id = 2)
SELECT `comments`.* FROM `comments` WHERE (`comments`.product_id = 4) ORDER BY created_at DESC