app/views/categories/show.html.erb

SELECT `products`.* FROM `products` WHERE (`products`.category_id = 1)
---
<div>
  <% @category.products.each do |product| %>